Tekla Open API Reference for Tekla Structures 2025
IdNumber Methods
The AssemblyFilterExpressions.IdNumber type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
AssemblyFilterExpressions.IdNumber Class
Tekla.Structures.Filtering.Categories Namespace